import styles from './Contents.module.sass';

export default function Contents({ bgColor = '#ffffff', gap = '1rem' }) {
  return (
    <div className={`${styles.container}`} style={{ backgroundColor: bgColor }}>
      <div className={`${styles.contents}`} style={{ gap: gap }}>
        {/* ==================================Test================================== */}
        <h1 className='font_h1'>Title</h1>
        <p>
          러안으로 소낭팓죠깁 혜한은 질차하고 미리싸슈 리오언비다. 보혝커달 겼니 더와 조앙은 료나발인은 닌밍나홀므믹
          먼쿠의 가으는 게캘렴리죽 혼나온려몰의. 임아참란골으로 쏩힌어기나 미더다녀질 스낀셈팟을 걸룩으루거다 레금
          익도모나다. 쟌낀멍간뇌에 뎠힐샂는 이어도 하응인왁을 다테날읜을 제아갈춘우셩은. 므긱매로부터 바라에서 후빌까
          겐딤 왈말지요, 여킽헌기는 삽있덜. 때만고 흐쩰을 디언늘아는 시허케칸겅만 맜압. 끙옴의 딥센절누뽀든 수제졸충에요
          무혼개에 란일뭐거가 딩강론딀에 옷으죠몀지내며 울녈 암주이아도. 쩌어가와 븩하의 염졸가느로 빈온도끼 아라.
          우고날 완보거다 랑체으준기완다 힌돠치으건도다 건숼다발고 민돨읏돈은 커봔칼지 났구에바기가. 오젱보다 너어지군
          스댕으라 오버게 나진션, 하옷틸욬을, 효나붕칠을 기파를 지기이축곤 심포. 겐즈휘끼츠다 비구다 우엦나
          아고젠룬다요닌시 고형잉으면서 이봐질은 제슨은 기터알이 칰산으로. 앙욪쉽진은 넝아가 슬논누디다머 애히즈우여닌고
          당랄후다 보라념으로 뎐차아쿠건고 게닉의 터외. 닐타 젼더느츤 라다악와로 찌수메의 딤단때고서 시로끤잔다. 규겅은
          캥모뗜 웡욘코흘어 뇹얜의 잖라궈 게룩을 랑고앤. 일죈고 로쁫냐브를 올의로서 쵼료깅은 다자가 흐루의 외마바조차.
          새으아잘허휜 엔안으느냐 팝건흔어요 디즈른잔 채암 틍서이솜다웄과, 촐믛의, 늘이아전는다. 던툰보껴 으근누
          진알직므로 뿌른늭아게 너나넹차다. 성소가안 시성힌이 은겨 뵤예를 느하잔너도아야 서앙은 성사를 즨츄쇼는
          과기쳐허, 숴다맨긔에. 기망의 에래주의 네님소 왈니루어어가 디으를 앨푀돠쯔다. 노수다 바매에다 안드에 묘올,
          시론은 저챌이바는 오민에 딧배고를 래라는 숴퐈바다, 람랴를. 엡랭에 응찰은 아하우라 시죙추통다 알옹민에
          뇰항히됴려고 거래티오꽈긴흔 더린 언콰인에다 으물마디흔미 지제홍무타다늑그다. 소더 들름힐어더러 니자
          일줌뉘다즏쳉을 간넌왜에. 퍄벲은 장쮜흐고로써 하지로 자옹전을 나자과한이 일혏시에. 고거으소의 언이훼운이 선훈은
          걸마으다 조브에 엥만시즈든가 복홊콜헝이다. 덜훈 아대깅아튼고 려린기샴의, 처이칭을 캄그워궀구를 점해
          말이가베이고, 지이이효다 젤황남옹과 아아난시.
        </p>
        <h1 className='font_h1'>Title</h1>
        <p>
          러안으로 소낭팓죠깁 혜한은 질차하고 미리싸슈 리오언비다. 보혝커달 겼니 더와 조앙은 료나발인은 닌밍나홀므믹
          먼쿠의 가으는 게캘렴리죽 혼나온려몰의. 임아참란골으로 쏩힌어기나 미더다녀질 스낀셈팟을 걸룩으루거다 레금
          익도모나다. 쟌낀멍간뇌에 뎠힐샂는 이어도 하응인왁을 다테날읜을 제아갈춘우셩은. 므긱매로부터 바라에서 후빌까
          겐딤 왈말지요, 여킽헌기는 삽있덜. 때만고 흐쩰을 디언늘아는 시허케칸겅만 맜압. 끙옴의 딥센절누뽀든 수제졸충에요
          무혼개에 란일뭐거가 딩강론딀에 옷으죠몀지내며 울녈 암주이아도. 쩌어가와 븩하의 염졸가느로 빈온도끼 아라.
          우고날 완보거다 랑체으준기완다 힌돠치으건도다 건숼다발고 민돨읏돈은 커봔칼지 났구에바기가. 오젱보다 너어지군
          스댕으라 오버게 나진션, 하옷틸욬을, 효나붕칠을 기파를 지기이축곤 심포. 겐즈휘끼츠다 비구다 우엦나
          아고젠룬다요닌시 고형잉으면서 이봐질은 제슨은 기터알이 칰산으로. 앙욪쉽진은 넝아가 슬논누디다머 애히즈우여닌고
          당랄후다 보라념으로 뎐차아쿠건고 게닉의 터외. 닐타 젼더느츤 라다악와로 찌수메의 딤단때고서 시로끤잔다. 규겅은
          캥모뗜 웡욘코흘어 뇹얜의 잖라궈 게룩을 랑고앤. 일죈고 로쁫냐브를 올의로서 쵼료깅은 다자가 흐루의 외마바조차.
          새으아잘허휜 엔안으느냐 팝건흔어요 디즈른잔 채암 틍서이솜다웄과, 촐믛의, 늘이아전는다. 던툰보껴 으근누
          진알직므로 뿌른늭아게 너나넹차다. 성소가안 시성힌이 은겨 뵤예를 느하잔너도아야 서앙은 성사를 즨츄쇼는
          과기쳐허, 숴다맨긔에. 기망의 에래주의 네님소 왈니루어어가 디으를 앨푀돠쯔다. 노수다 바매에다 안드에 묘올,
          시론은 저챌이바는 오민에 딧배고를 래라는 숴퐈바다, 람랴를. 엡랭에 응찰은 아하우라 시죙추통다 알옹민에
          뇰항히됴려고 거래티오꽈긴흔 더린 언콰인에다 으물마디흔미 지제홍무타다늑그다. 소더 들름힐어더러 니자
          일줌뉘다즏쳉을 간넌왜에. 퍄벲은 장쮜흐고로써 하지로 자옹전을 나자과한이 일혏시에. 고거으소의 언이훼운이 선훈은
          걸마으다 조브에 엥만시즈든가 복홊콜헝이다. 덜훈 아대깅아튼고 려린기샴의, 처이칭을 캄그워궀구를 점해
          말이가베이고, 지이이효다 젤황남옹과 아아난시.
        </p>
        <h1 className='font_h1'>Title</h1>
        <p>
          러안으로 소낭팓죠깁 혜한은 질차하고 미리싸슈 리오언비다. 보혝커달 겼니 더와 조앙은 료나발인은 닌밍나홀므믹
          먼쿠의 가으는 게캘렴리죽 혼나온려몰의. 임아참란골으로 쏩힌어기나 미더다녀질 스낀셈팟을 걸룩으루거다 레금
          익도모나다. 쟌낀멍간뇌에 뎠힐샂는 이어도 하응인왁을 다테날읜을 제아갈춘우셩은. 므긱매로부터 바라에서 후빌까
          겐딤 왈말지요, 여킽헌기는 삽있덜. 때만고 흐쩰을 디언늘아는 시허케칸겅만 맜압. 끙옴의 딥센절누뽀든 수제졸충에요
          무혼개에 란일뭐거가 딩강론딀에 옷으죠몀지내며 울녈 암주이아도. 쩌어가와 븩하의 염졸가느로 빈온도끼 아라.
          우고날 완보거다 랑체으준기완다 힌돠치으건도다 건숼다발고 민돨읏돈은 커봔칼지 났구에바기가. 오젱보다 너어지군
          스댕으라 오버게 나진션, 하옷틸욬을, 효나붕칠을 기파를 지기이축곤 심포. 겐즈휘끼츠다 비구다 우엦나
          아고젠룬다요닌시 고형잉으면서 이봐질은 제슨은 기터알이 칰산으로. 앙욪쉽진은 넝아가 슬논누디다머 애히즈우여닌고
          당랄후다 보라념으로 뎐차아쿠건고 게닉의 터외. 닐타 젼더느츤 라다악와로 찌수메의 딤단때고서 시로끤잔다. 규겅은
          캥모뗜 웡욘코흘어 뇹얜의 잖라궈 게룩을 랑고앤. 일죈고 로쁫냐브를 올의로서 쵼료깅은 다자가 흐루의 외마바조차.
          새으아잘허휜 엔안으느냐 팝건흔어요 디즈른잔 채암 틍서이솜다웄과, 촐믛의, 늘이아전는다. 던툰보껴 으근누
          진알직므로 뿌른늭아게 너나넹차다. 성소가안 시성힌이 은겨 뵤예를 느하잔너도아야 서앙은 성사를 즨츄쇼는
          과기쳐허, 숴다맨긔에. 기망의 에래주의 네님소 왈니루어어가 디으를 앨푀돠쯔다. 노수다 바매에다 안드에 묘올,
          시론은 저챌이바는 오민에 딧배고를 래라는 숴퐈바다, 람랴를. 엡랭에 응찰은 아하우라 시죙추통다 알옹민에
          뇰항히됴려고 거래티오꽈긴흔 더린 언콰인에다 으물마디흔미 지제홍무타다늑그다. 소더 들름힐어더러 니자
          일줌뉘다즏쳉을 간넌왜에. 퍄벲은 장쮜흐고로써 하지로 자옹전을 나자과한이 일혏시에. 고거으소의 언이훼운이 선훈은
          걸마으다 조브에 엥만시즈든가 복홊콜헝이다. 덜훈 아대깅아튼고 려린기샴의, 처이칭을 캄그워궀구를 점해
          말이가베이고, 지이이효다 젤황남옹과 아아난시.
        </p>
        <h1 className='font_h1'>Title</h1>
        <p>
          러안으로 소낭팓죠깁 혜한은 질차하고 미리싸슈 리오언비다. 보혝커달 겼니 더와 조앙은 료나발인은 닌밍나홀므믹
          먼쿠의 가으는 게캘렴리죽 혼나온려몰의. 임아참란골으로 쏩힌어기나 미더다녀질 스낀셈팟을 걸룩으루거다 레금
          익도모나다. 쟌낀멍간뇌에 뎠힐샂는 이어도 하응인왁을 다테날읜을 제아갈춘우셩은. 므긱매로부터 바라에서 후빌까
          겐딤 왈말지요, 여킽헌기는 삽있덜. 때만고 흐쩰을 디언늘아는 시허케칸겅만 맜압. 끙옴의 딥센절누뽀든 수제졸충에요
          무혼개에 란일뭐거가 딩강론딀에 옷으죠몀지내며 울녈 암주이아도. 쩌어가와 븩하의 염졸가느로 빈온도끼 아라.
          우고날 완보거다 랑체으준기완다 힌돠치으건도다 건숼다발고 민돨읏돈은 커봔칼지 났구에바기가. 오젱보다 너어지군
          스댕으라 오버게 나진션, 하옷틸욬을, 효나붕칠을 기파를 지기이축곤 심포. 겐즈휘끼츠다 비구다 우엦나
          아고젠룬다요닌시 고형잉으면서 이봐질은 제슨은 기터알이 칰산으로. 앙욪쉽진은 넝아가 슬논누디다머 애히즈우여닌고
          당랄후다 보라념으로 뎐차아쿠건고 게닉의 터외. 닐타 젼더느츤 라다악와로 찌수메의 딤단때고서 시로끤잔다. 규겅은
          캥모뗜 웡욘코흘어 뇹얜의 잖라궈 게룩을 랑고앤. 일죈고 로쁫냐브를 올의로서 쵼료깅은 다자가 흐루의 외마바조차.
          새으아잘허휜 엔안으느냐 팝건흔어요 디즈른잔 채암 틍서이솜다웄과, 촐믛의, 늘이아전는다. 던툰보껴 으근누
          진알직므로 뿌른늭아게 너나넹차다. 성소가안 시성힌이 은겨 뵤예를 느하잔너도아야 서앙은 성사를 즨츄쇼는
          과기쳐허, 숴다맨긔에. 기망의 에래주의 네님소 왈니루어어가 디으를 앨푀돠쯔다. 노수다 바매에다 안드에 묘올,
          시론은 저챌이바는 오민에 딧배고를 래라는 숴퐈바다, 람랴를. 엡랭에 응찰은 아하우라 시죙추통다 알옹민에
          뇰항히됴려고 거래티오꽈긴흔 더린 언콰인에다 으물마디흔미 지제홍무타다늑그다. 소더 들름힐어더러 니자
          일줌뉘다즏쳉을 간넌왜에. 퍄벲은 장쮜흐고로써 하지로 자옹전을 나자과한이 일혏시에. 고거으소의 언이훼운이 선훈은
          걸마으다 조브에 엥만시즈든가 복홊콜헝이다. 덜훈 아대깅아튼고 려린기샴의, 처이칭을 캄그워궀구를 점해
          말이가베이고, 지이이효다 젤황남옹과 아아난시.
        </p>
        {/* ==================================Test================================== */}
      </div>
    </div>
  );
}
